/*
Navicat MySQL Data Transfer

Source Server         : mysql
Source Server Version : 50717
Source Host           : localhost:3306
Source Database       : projectsys

Target Server Type    : MYSQL
Target Server Version : 50717
File Encoding         : 65001

Date: 2021-06-04 11:24:33
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for admin
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(6) NOT NULL,
  `password` varchar(36) COLLATE utf8mb4_bin NOT NULL,
  `name` varchar(20) COLLATE utf8mb4_bin NOT NULL,
  `role` int(11) NOT NULL,
  `department` varchar(20) COLLATE utf8mb4_bin NOT NULL,
  `work_type` int(20) NOT NULL,
  `tel` varchar(20) COLLATE utf8mb4_bin NOT NULL,
  `isbusy` int(10) DEFAULT NULL,
  `last_login_at` datetime DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  `created_at` datetime DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  `updated_at` datetime DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`,`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=22 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of admin
-- ----------------------------
INSERT INTO `admin` VALUES ('1', '202101', 'admin', '张三', '1', '项目部', '0', '15928142563', '0', '2021-05-28 10:34:31', '2021-05-28 10:34:31', '2021-05-28 10:34:31');
INSERT INTO `admin` VALUES ('2', '202102', 'admin', '李四', '2', '销售部', '1', '15928142563', '0', '2021-05-28 09:53:29', '2021-05-28 09:53:29', '2021-05-28 09:53:29');
INSERT INTO `admin` VALUES ('3', '202103', 'admin', '王五', '3', '施工部', '2', '15928142563', '1', '2021-05-28 10:39:26', '2021-05-28 10:39:26', '2021-05-28 10:39:26');
INSERT INTO `admin` VALUES ('7', '202104', 'admin', '小刘', '3', '施工部', '2', '15928142563', '0', '2021-05-27 13:31:48', '2021-05-27 13:31:48', '2021-05-27 13:31:48');
INSERT INTO `admin` VALUES ('9', '202105', 'admin', '小李', '3', '施工部', '2', '15928142563', '0', '2021-05-27 13:32:25', '2021-05-27 13:32:25', '2021-05-27 13:32:25');
INSERT INTO `admin` VALUES ('10', '202106', 'admin', '测试用户', '3', '施工部', '2', '15928142563', '0', '2021-05-27 13:32:25', '2021-05-27 13:32:25', '2021-05-27 13:32:25');
INSERT INTO `admin` VALUES ('11', '202107', 'admin', '员工', '3', '施工部', '2', '15928142563', '0', '2021-05-27 21:14:23', '2021-05-27 21:14:23', '2021-05-27 21:14:23');
INSERT INTO `admin` VALUES ('12', '202108', 'admin', '员工2', '3', '施工部', '3', '15928142563', '1', '2021-05-28 07:49:13', '2021-05-28 07:49:13', '2021-05-28 07:49:13');
INSERT INTO `admin` VALUES ('13', '202109', 'admin', '员工3', '3', '施工部', '3', '15928142563', '1', '2021-05-27 13:30:52', '2021-05-27 13:30:52', '2021-05-27 13:30:52');
INSERT INTO `admin` VALUES ('16', '202112', '1231', '测试员工12', '3', '施工部', '3', '123154545645', '1', '2021-05-27 13:30:15', '2021-05-27 13:30:15', '2021-05-27 13:30:15');
INSERT INTO `admin` VALUES ('19', '202113', 'admin', '项目经理2', '1', '项目部', '0', '12345232412', '0', '2021-05-27 13:30:15', '2021-05-27 13:43:03', '2021-05-27 13:43:03');
INSERT INTO `admin` VALUES ('20', '202114', 'admin', '项目经理3', '1', '项目部', '0', '12345214325', '0', '2021-05-27 13:44:53', '2021-05-27 13:44:53', '2021-05-27 13:44:53');
INSERT INTO `admin` VALUES ('21', '202115', 'admin', '项目经理', '1', '项目部', '4', '12345612345', '0', '2021-05-28 07:50:47', '2021-05-28 07:50:47', '2021-05-28 07:50:47');

-- ----------------------------
-- Table structure for orderlist
-- ----------------------------
DROP TABLE IF EXISTS `orderlist`;
CREATE TABLE `orderlist` (
  `id` int(20) NOT NULL AUTO_INCREMENT,
  `trad_no` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL,
  `title` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL,
  `info` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `sign_time` datetime(6) DEFAULT NULL,
  `type` int(10) DEFAULT NULL,
  `limit_time` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL,
  `tel` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL,
  `address` varchar(100) COLLATE utf8mb4_bin DEFAULT NULL,
  `certificate` varchar(100) COLLATE utf8mb4_bin DEFAULT NULL,
  `created_at` datetime(6) DEFAULT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of orderlist
-- ----------------------------
INSERT INTO `orderlist` VALUES ('1', '20210501120809', '地暖安装', '地暖工程', '2021-04-15 22:23:00.000000', '1', '7天', '15112456983', '成都市郫都区郫筒中信大道二段', 'http://localhost:3002/img/1622096438108QQ截图20210527141939.png', '2021-04-01 18:45:52.000000', '2021-04-11 13:11:15.000000');
INSERT INTO `orderlist` VALUES ('2', '20210501120812', '太阳能安装', '安装客户需要提出的地暖设施', '2021-04-14 22:23:05.000000', '2', '7天', '15112456983', '成都市郫都区郫筒中信大道二段', 'http://localhost:3002/img/1622096438108QQ截图20210527141939.png', '2021-04-02 18:47:36.000000', '2021-04-11 13:18:53.000000');
INSERT INTO `orderlist` VALUES ('3', '20210501120810', '管道安装', '订单信息2', '2021-04-07 22:23:10.000000', '1', '7天', '15112456983', '成都市郫都区郫筒中信大道二段', 'http://localhost:3002/img/1622096438108QQ截图20210527141939.png', '2021-03-05 13:22:45.000000', '2021-04-05 13:24:05.000000');
INSERT INTO `orderlist` VALUES ('4', '20210501120836', '线槽挖掘', '订单信息3', '2021-04-10 00:00:00.000000', '3', '14天', '15112456983', '成都市郫都区郫筒中信大道二段', 'http://localhost:3002/img/1622096438108QQ截图20210527141939.png', '2021-04-14 13:22:55.000000', '2021-05-03 15:43:12.000000');
INSERT INTO `orderlist` VALUES ('5', '20210501120818', '订单4', '订单信息4', '2021-03-09 22:23:18.000000', '1', '7天', '15112456983', '成都市郫都区郫筒中信大道二段', 'http://localhost:3002/img/1622096438108QQ截图20210527141939.png', '2021-04-08 13:23:23.000000', '2021-04-15 13:23:44.000000');
INSERT INTO `orderlist` VALUES ('6', '20210501120898', '订单5', '订单信息5', '2021-04-14 22:23:24.000000', '2', '30天', '15112456983', '成都市郫都区郫筒中信大道二段', 'http://localhost:3002/img/1622096438108QQ截图20210527141939.png', '2021-04-16 13:23:27.000000', '2021-04-14 13:23:47.000000');
INSERT INTO `orderlist` VALUES ('7', '20210501120857', '订单6', '订单信息6', '2021-03-11 22:23:30.000000', '3', '14天', '15112456983', '成都市郫都区郫筒中信大道二段', 'http://localhost:3002/img/1622096438108QQ截图20210527141939.png', '2021-04-02 00:00:00.000000', '2021-04-11 13:56:20.000000');
INSERT INTO `orderlist` VALUES ('8', '20210501120886', '订单7', '订单信息7', '2021-03-03 00:00:00.000000', '1', '14天', '15112456983', '成都市郫都区郫筒中信大道二段', 'http://localhost:3002/img/1622096438108QQ截图20210527141939.png', '2021-04-23 13:23:33.000000', '2021-05-03 16:02:58.000000');
INSERT INTO `orderlist` VALUES ('9', '20210501120832', '订单8', '订单信息8', '2021-02-02 22:23:39.000000', '2', '30天', '15112456983', '成都市郫都区郫筒中信大道二段', 'http://localhost:3002/img/1622096438108QQ截图20210527141939.png', '2021-04-07 13:23:37.000000', '2021-04-06 13:24:02.000000');
INSERT INTO `orderlist` VALUES ('10', '20210501120880', '订单测试', '这是一段很长的内容展示订单内容很长很长很长很长很长很长很长很长很长很长很长', '2021-04-09 00:00:00.000000', '1', '7天', '15112456983', '成都市郫都区郫筒中信大道二段', 'http://localhost:3002/img/1622096438108QQ截图20210527141939.png', '2021-04-17 19:08:11.000000', '2021-05-03 15:40:19.000000');
INSERT INTO `orderlist` VALUES ('14', '20210503846512', '测试签单', '测试签单11212', '2021-05-03 00:00:00.000000', '1', '14天', '12345678933', '成都', 'http://localhost:3002/img/1622096438108QQ截图20210527141939.png', '2021-05-03 17:07:11.000000', '2021-05-27 14:20:50.000000');
INSERT INTO `orderlist` VALUES ('15', '20210527510959', '系统测试签单', '新建内容', '2021-05-18 00:00:00.000000', '1', '30天', '12345678912', '测试地址', 'http://localhost:3002/img/1622096815769QQ截图20210527141939.png', '2021-05-27 14:26:58.000000', '2021-05-27 14:26:58.000000');

-- ----------------------------
-- Table structure for project
-- ----------------------------
DROP TABLE IF EXISTS `project`;
CREATE TABLE `project` (
  `id` int(20) NOT NULL AUTO_INCREMENT,
  `main_uid` int(20) DEFAULT NULL,
  `name` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL,
  `content` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `type` int(20) DEFAULT NULL,
  `address` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL,
  `start_time` datetime(6) DEFAULT NULL,
  `end_time` datetime(6) DEFAULT NULL,
  `status` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL,
  `finish` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL,
  `created_at` datetime(6) DEFAULT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=37 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of project
-- ----------------------------
INSERT INTO `project` VALUES ('13', '202101', '地暖安装', '地暖安装测试内容', '2', '成都市郫都区中信大道', '2021-05-01 00:00:00.000000', '2021-05-07 00:00:00.000000', '正常', '已结项', '2021-05-03 22:03:22.000000', '2021-05-28 08:37:27.000000');
INSERT INTO `project` VALUES ('14', '202113', '测试项目1', '安装地暖', '1', '成都市郫都区中信大道', '2021-05-02 00:00:00.000000', '2021-05-07 00:00:00.000000', '加急', '进行中', '2021-05-03 22:03:22.000000', '2021-05-27 13:45:24.000000');
INSERT INTO `project` VALUES ('15', '202101', '测试项目2', '安装地暖12', '1', '成都市郫都区中信大道', '2021-05-01 00:00:00.000000', '2021-05-07 00:00:00.000000', '加急', '进行中', '2021-05-03 22:03:22.000000', '2021-05-27 13:46:14.000000');
INSERT INTO `project` VALUES ('16', '202114', '测试项目3', '测试内容1', '1', '成都市郫都区中信大道', '2021-05-01 00:00:00.000000', '2021-05-07 00:00:00.000000', '加急', '进行中', '2021-05-03 22:03:22.000000', '2021-05-27 13:47:46.000000');
INSERT INTO `project` VALUES ('17', '202114', '测试项目4', '测试内容2', '1', '成都市郫都区中信大道', '2021-05-01 00:00:00.000000', '2021-05-07 00:00:00.000000', '加急', '进行中', '2021-05-03 22:03:22.000000', '2021-05-27 13:45:40.000000');
INSERT INTO `project` VALUES ('18', '202113', '测试项目5', '测试内容37', '1', '成都市郫都区中信大道', '2021-05-01 00:00:00.000000', '2021-05-07 00:00:00.000000', '加急', '进行中', '2021-05-03 22:03:22.000000', '2021-05-27 13:46:10.000000');
INSERT INTO `project` VALUES ('19', '202101', '地暖安装测试', '测试内容4', '1', '成都市郫都区中信大道', '2021-05-02 00:00:00.000000', '2021-05-07 00:00:00.000000', '加急', '进行中', '2021-05-03 22:03:22.000000', '2021-05-03 22:03:22.000000');
INSERT INTO `project` VALUES ('20', '202101', '太阳能安装', '测试内容45', '1', '成都市郫都区中信大道', '2021-05-01 00:00:00.000000', '2021-05-07 00:00:00.000000', '正常', '进行中', '2021-05-03 22:03:22.000000', '2021-05-03 22:03:22.000000');
INSERT INTO `project` VALUES ('21', '202101', '测试项目21', '测试内容8', '1', '成都市郫都区中信大道', '2021-05-03 00:00:00.000000', '2021-05-07 00:00:00.000000', '正常', '进行中', '2021-05-03 22:03:22.000000', '2021-05-27 13:46:04.000000');
INSERT INTO `project` VALUES ('22', '202101', '测试项目22', '测试内容7', '1', '成都市郫都区中信大道', '2021-05-01 00:00:00.000000', '2021-05-07 00:00:00.000000', '正常', '进行中', '2021-05-03 22:03:22.000000', '2021-05-03 22:03:22.000000');
INSERT INTO `project` VALUES ('23', '202101', '测试项目23', '测试内容9', '1', '成都市郫都区中信大道', '2021-05-01 00:00:00.000000', '2021-05-07 00:00:00.000000', '正常', '进行中', '2021-05-03 22:03:22.000000', '2021-05-03 22:03:22.000000');
INSERT INTO `project` VALUES ('24', '202101', '测试项目24', '测试内容10', '1', '成都市郫都区中信大道', '2021-05-04 00:00:00.000000', '2021-05-07 00:00:00.000000', '正常', '未开始', '2021-05-03 22:03:22.000000', '2021-05-03 22:03:22.000000');
INSERT INTO `project` VALUES ('25', '202101', '测试项目25', '测试内容41', '2', '成都市郫都区中信大道', '2021-05-01 00:00:00.000000', '2021-05-07 00:00:00.000000', '正常', '未开始', '2021-05-03 22:03:22.000000', '2021-05-03 22:03:22.000000');
INSERT INTO `project` VALUES ('26', '202101', '测试项目26', '测试内容14', '2', '成都市郫都区中信大道', '2021-05-04 00:00:00.000000', '2021-05-07 00:00:00.000000', '正常', '未开始', '2021-05-03 22:03:22.000000', '2021-05-03 22:03:22.000000');
INSERT INTO `project` VALUES ('27', '202101', '测试项目6', '测试内容80', '2', '成都市郫都区中信大道', '2021-05-01 00:00:00.000000', '2021-05-07 00:00:00.000000', '正常', '未开始', '2021-05-03 22:03:22.000000', '2021-05-03 22:03:22.000000');
INSERT INTO `project` VALUES ('28', '202101', '测试项目7', '测试内容78', '2', '成都市郫都区中信大道', '2021-05-01 00:00:00.000000', '2021-05-07 00:00:00.000000', '正常', '未开始', '2021-05-03 22:03:22.000000', '2021-05-03 22:03:22.000000');
INSERT INTO `project` VALUES ('29', '202101', '测试项目8', '测试内容55', '2', '成都市郫都区中信大道', '2021-05-03 00:00:00.000000', '2021-05-07 00:00:00.000000', '正常', '已结项', '2021-05-03 22:03:22.000000', '2021-05-03 22:03:22.000000');
INSERT INTO `project` VALUES ('30', '202101', '测试项目9', '测试内容12', '3', '成都市郫都区中信大道', '2021-05-01 00:00:00.000000', '2021-05-07 00:00:00.000000', '正常', '已结项', '2021-05-03 22:03:22.000000', '2021-05-27 13:47:24.000000');
INSERT INTO `project` VALUES ('31', '202113', '测试项目10', '测试内容47', '3', '成都市郫都区中信大道', '2021-05-02 00:00:00.000000', '2021-05-07 00:00:00.000000', '延期', '已结项', '2021-05-03 22:03:22.000000', '2021-05-27 13:46:45.000000');
INSERT INTO `project` VALUES ('32', '202101', '测试项目11', '测试内容77', '3', '成都市郫都区中信大道', '2021-05-01 00:00:00.000000', '2021-05-07 00:00:00.000000', '延期', '已结项', '2021-05-03 22:03:22.000000', '2021-05-27 13:47:57.000000');
INSERT INTO `project` VALUES ('33', '202101', '测试项目12', '测试内容52', '3', '成都市郫都区中信大道', '2021-05-01 00:00:00.000000', '2021-05-07 00:00:00.000000', '延期', '已结项', '2021-05-03 22:03:22.000000', '2021-05-03 22:03:22.000000');
INSERT INTO `project` VALUES ('34', '202113', '新建项目1222', '测试新建', '3', '成都市郫都区中信大道', '2021-05-02 00:00:00.000000', '2021-05-09 00:00:00.000000', '正常', '未开始', '2021-05-05 14:43:53.000000', '2021-05-27 13:43:49.000000');
INSERT INTO `project` VALUES ('35', '202115', '测试新建项目', '新建项目', '2', '成都地区', '2021-05-29 00:00:00.000000', '2021-05-31 00:00:00.000000', '正常', '未开始', '2021-05-28 07:53:27.000000', '2021-05-28 07:53:27.000000');

-- ----------------------------
-- Table structure for question
-- ----------------------------
DROP TABLE IF EXISTS `question`;
CREATE TABLE `question` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `uid` int(6) NOT NULL,
  `name` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL,
  `project` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL,
  `content` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `created_at` datetime(6) DEFAULT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of question
-- ----------------------------
INSERT INTO `question` VALUES ('1', '202101', '小王', '项目1', '问题啊啊啊', '2021-04-01 22:29:29.000000', '2021-04-01 22:29:33.000000');
INSERT INTO `question` VALUES ('2', '202102', '小李', '项目2', '问题内容1', '2021-04-01 22:29:29.000000', '2021-04-01 22:29:33.000000');
INSERT INTO `question` VALUES ('3', '202103', '小刘', '项目3', '问题内容2', '2021-04-01 22:29:29.000000', '2021-04-01 22:29:33.000000');
INSERT INTO `question` VALUES ('4', '202104', '员工1', '项目4', '问题内容5', '2021-04-01 22:29:29.000000', '2021-04-01 22:29:33.000000');
INSERT INTO `question` VALUES ('5', '202105', '员工2', '项目5', '问题内容8', '2021-04-01 22:29:29.000000', '2021-04-01 22:29:33.000000');
INSERT INTO `question` VALUES ('6', '202106', '员工3', '项目6', '问题内容7很长很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容', '2021-04-01 22:29:29.000000', '2021-04-01 22:29:33.000000');
INSERT INTO `question` VALUES ('7', '202107', '员工4', '项目7', '问题内容9很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容', '2021-04-01 22:29:29.000000', '2021-04-01 22:29:33.000000');
INSERT INTO `question` VALUES ('8', '202108', '员工5', '项目8', '问题内容3很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容', '2021-04-01 22:29:29.000000', '2021-04-01 22:29:33.000000');
INSERT INTO `question` VALUES ('9', '202101', '员工6', '项目9', '问题内容4很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容很长的问题内容', '2021-04-17 18:42:39.000000', '2021-04-17 18:42:39.000000');
INSERT INTO `question` VALUES ('10', '202101', '张三', '小李', '测试内容\n测试测试\n测试', '2021-04-21 22:44:27.000000', '2021-04-21 22:44:27.000000');

-- ----------------------------
-- Table structure for task
-- ----------------------------
DROP TABLE IF EXISTS `task`;
CREATE TABLE `task` (
  `id` int(20) NOT NULL AUTO_INCREMENT,
  `title` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL,
  `info` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `project` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL,
  `start_time` datetime(6) DEFAULT NULL,
  `end_time` datetime(6) DEFAULT NULL,
  `finish` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL,
  `uid` int(20) DEFAULT NULL,
  `executor` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL,
  `todo` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL,
  `created_at` datetime(6) DEFAULT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=24 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of task
-- ----------------------------
INSERT INTO `task` VALUES ('1', '任务1', '任务内容1', '测试项目', '2021-04-01 00:00:00.000000', '2021-04-04 00:00:00.000000', '已完成', '202108', '小王', '未认领', '2021-04-06 21:49:53.000000', '2021-04-14 23:19:54.000000');
INSERT INTO `task` VALUES ('2', '任务2', '任务内容2很长的任务内容很长的任务内容很长的任务内容很长的任务内容很长的任务内容很长的任务内容', '测试项目', '2021-04-01 00:00:00.000000', '2021-04-01 00:00:00.000000', '进行中', '202105', '小李', '已认领', '2021-04-12 21:49:57.000000', '2021-04-17 17:53:40.000000');
INSERT INTO `task` VALUES ('3', '任务3', '任务内容2', '测试项目2', '2021-04-01 00:00:00.000000', '2021-04-01 00:00:00.000000', '未开始', '202108', '员工1', '已认领', '2021-04-12 21:49:57.000000', '2021-04-15 22:22:20.000000');
INSERT INTO `task` VALUES ('9', '任务4', '任务内容3', '测试项目4', '2021-04-01 00:00:00.000000', '2021-04-01 00:00:00.000000', '进行中', '202108', '员工2', '未认领', '2021-04-12 21:49:57.000000', '2021-04-15 22:06:10.000000');
INSERT INTO `task` VALUES ('10', '任务5', '任务内容4', '测试项目', '2021-04-01 00:00:00.000000', '2021-04-01 00:00:00.000000', '未开始', '202108', '员工3', '已认领', '2021-04-12 21:49:57.000000', '2021-05-28 07:49:12.000000');
INSERT INTO `task` VALUES ('11', '任务6', '任务内容5', '测试项目5', '2021-04-01 00:00:00.000000', '2021-04-01 00:00:00.000000', '进行中', '202108', '员工4', '已认领', '2021-04-12 21:49:57.000000', '2021-04-21 22:15:42.000000');
INSERT INTO `task` VALUES ('12', '任务7', '任务内容6', '测试项目', '2021-04-01 22:44:45.000000', '2021-04-01 22:44:45.000000', '未开始', '202108', '员工5', '未认领', '2021-04-12 21:49:57.000000', null);
INSERT INTO `task` VALUES ('13', '任务8', '任务内容7', '测试项目3', '2021-04-01 22:44:45.000000', '2021-04-01 22:44:45.000000', '进行中', '202108', '员工6', '未认领', '2021-04-12 21:49:57.000000', null);
INSERT INTO `task` VALUES ('14', '任务9', '任务内容8', '测试项目2', '2021-04-01 22:44:45.000000', '2021-04-01 22:44:45.000000', '进行中', '202108', '员工7', '未认领', '2021-04-12 21:49:57.000000', null);
INSERT INTO `task` VALUES ('15', '测试', '任务内容9', '测试项目2', '2021-04-01 00:00:00.000000', '2021-04-02 00:00:00.000000', '进行中', '202108', '小王', '已认领', '2021-04-14 23:19:36.000000', '2021-04-21 22:20:58.000000');
INSERT INTO `task` VALUES ('16', '测试', '任务内容10', '测试项目4', '2021-04-01 00:00:00.000000', '2021-04-02 00:00:00.000000', '未开始', '202108', '小王', '已认领', '2021-04-14 23:19:37.000000', '2021-05-26 12:49:06.000000');
INSERT INTO `task` VALUES ('17', '测试任务', '任务内容11', '测试项目', '2021-04-19 00:00:00.000000', '2021-04-07 00:00:00.000000', '未开始', '202108', '李四', '已认领', '2021-04-15 22:23:42.000000', '2021-05-03 19:26:12.000000');
INSERT INTO `task` VALUES ('18', '测试任务10', '任务内容12', '测试项目5', '2021-04-04 00:00:00.000000', '2021-04-06 00:00:00.000000', '未开始', '202103', '王五', '未认领', '2021-04-17 19:08:29.000000', '2021-05-03 21:47:12.000000');
INSERT INTO `task` VALUES ('22', '管道安装', '海德管道安装，长度20米', '测试项目5', '2021-05-03 00:00:00.000000', '2021-05-04 00:00:00.000000', '未开始', '202103', '王五', '已认领', '2021-05-03 21:40:55.000000', '2021-05-28 10:39:26.000000');

-- ----------------------------
-- Table structure for team
-- ----------------------------
DROP TABLE IF EXISTS `team`;
CREATE TABLE `team` (
  `id` int(6) NOT NULL AUTO_INCREMENT,
  `lid` int(6) DEFAULT NULL,
  `pid` int(6) DEFAULT NULL,
  `project_name` varchar(50) COLLATE utf8mb4_bin DEFAULT NULL,
  `member` varchar(50) COLLATE utf8mb4_bin DEFAULT NULL,
  `leader` varchar(20) COLLATE utf8mb4_bin DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of team
-- ----------------------------
INSERT INTO `team` VALUES ('1', '202101', '13', '地暖安装', '202103,202104,202105', '张三');
